#include <stdio.h>

void main()
{
	//homework4_3
	printf("字符串和字符数组的区别?\n");
	printf("字符串存放到字符数组中,但是字符数组的长度与字符串的长度不一样.\n");
	printf("字符串以\\0作为结束标记\n");
	printf("字符数组并不能要求它的最后一个字符为\\0,甚至可以不包含\\0\n");

	//homework4_4
	printf("\n数组初始化的时候,数组的长度说明什么情况下可以省略?\n");
	printf("1.对一维数组的全部元素赋初值得时候 可以不指定数组长度.\n");
	printf("int a[5]={1,2,3,4,5} 等价于 int a[]={1,2,3,4,5}");
	printf("2.对二维数组全部元素都赋初值得时候,可以省略数组的第一维度,但第二维度不能省略\n");
	printf("int a[][]4={{1,3},{4}}), 第一维度自动设置为2.\n");
	printf("3.对字符数组全部元素赋初值的时候可以省去长度:\n");
	printf("char c[]={'C','h','i','n','a'}, 字符数组c的长度自动设置为5,注意字符数组的结尾可以不是\\0\n");
	printf("4.对字符串赋值得时候,长度\(第一维度\)可以省略 .\n");
	printf("char c[]={\"Chinese\"}; 字符串的长度是7 但是字符数组的长度是8.\n");
	printf("等价于char c[]={'C','h','i','n','e','s','e','\\0'};");
	printf("如果char c[]={'C','h','i','n','e','s','e'}; 则不是字符串,字符数组的长度为7,不是8.")'


}